//
//  ResultViewController.swift
//  WakaQuiz
//
//  Created by MiraiNIKI on 2016/02/19.
//  Copyright © 2016年 UnivercityofTsukuba. All rights reserved.
//

import UIKit

class ResultViewController: UIViewController {

    @IBOutlet weak var resultLabel: UILabel!
    @IBOutlet weak var haikeiLabel: UIImageView!
    @IBOutlet weak var wakaTextView: UITextView!
    var ifAnswer: Bool = false
    var questionIndex: Int = 0
    
    let wakaArray:NSArray = ["秋の田のかりほの庵の苫をあらみ\nわが衣手は露にぬれつつ","春過ぎて夏来にけらし白妙の\n衣干すてふ天の香具山","あしびきの山鳥の尾のしだり尾の\nながながし夜をひとりかも寝む","田子の浦にうち出でて見れば白妙の\n富士の高嶺に雪は降りつつ","奥山に紅葉踏み分け鳴く鹿の\n声聞く時ぞ秋は悲しき",
        "鵲の渡せる橋に置く霜の\n白きを見れば夜ぞ更けにける ","天の原ふりさけ見れば春日なる\n三笠の山に出でし月かも","わが庵は都の辰巳しかぞ住む\n世をうぢ山と人はいふなり","花の色は移りにけりないたづらに\nわが身世にふるながめせしまに","これやこの行くも帰るも別れては\n知るも知らぬもあふ坂の関",
        "わたの原八十島かけて漕ぎ出でぬと\n人には告げよ海人の釣船 ","天つ風雲の通ひ路吹きとぢよ\n乙女の姿しばしとどめむ","筑波嶺の峰より落つるみなの川\n恋ぞ積もりて淵となりぬる","陸奥のしのぶもぢずりたれゆえに\n乱れそめにしわれならなくに","君がため春の野に出でて若菜摘む\nわが衣手に雪は降りつつ",
        "立ち別れいなばの山の峰に生ふる\nまつとし聞かば今帰り来む","ちはやぶる神代も聞かず竜田川\nからくれなゐに水くくるとは ","住の江の岸に寄る波よるさへや\n夢の通ひ路人目よくらむ","難波潟短き蘆のふしの間も\n逢はでこの世を過ぐしてよとや","わびぬれば今はたおなじ難波なる\nみをつくしても逢はむとぞ思ふ",
        "今来むといひしばかりに長月の\n有明の月を待ち出でつるかな","吹くからに秋の草木のしをるれば\nむべ山風をあらしといふらむ","月見ればちぢにものこそ悲しけれ\nわが身ひとつの秋にはあらねど","このたびは幣も取りあへず手向山\n紅葉の錦神のまにまに","名にし負はば逢う坂山のさねかずら\n人に知られで来るよしもがな",
        "小倉山峰の紅葉葉心あらば\nいまひとたびのみゆき待たなむ ","みかの原わきて流るるいづみ川\nいつ見きとてか恋しかるらむ ","山里は冬ぞ寂しさまさりける\n人目も草もかれぬと思へば ","心あてに折らばや折らむ初霜の\n置きまどはせる白菊の花 ","有明のつれなく見えし別れより\n暁ばかり憂きものはなし",
        "朝ぼらけ有明の月と見るまでに\n吉野の里に降れる白雪","山川に風のかけたるしがらみは\n流れもあへぬ紅葉なりけり","ひさかたの光のどけき春の日に\nしづ心なく花の散るらむ","誰をかも知る人にせむ高砂の\n松も昔の友ならなくに","人はいさ心も知らずふるさとは\n花ぞ昔の香に匂ひける",
        "夏の夜はまだ宵ながら明けぬるを\n雲のいずこに月宿るらむ","白露に風の吹きしく秋の野は\nつらぬきとめぬ玉ぞ散りける","忘らるる身をば思はず誓ひてし\n人の命の惜しくもあるかな","浅茅生の小野の篠原忍ぶれど\nあまりてなどか人の恋しき","忍ぶれど色に出でにけりわが恋は\nものや思ふと人の問ふまで",
        "恋すてふわが名はまだき立ちにけり\n人知れずこそ思ひそめしか","契りきなかたみに袖をしぼりつつ\n末の松山波越さじとは ","逢ひ見てののちの心にくらぶれば\n昔はものを思はざりけり","逢ふことの絶えてしなくはなかなかに\n人をも身をも恨みざらまし","あはれともいふべき人は思ほえで\n　　身のいたずらになりぬべきかな",
        "由良の門を渡る舟人かぢを絶え\nゆくへも知らぬ恋のみちかな","由良の門を渡る舟人かぢを絶え\nゆくへも知らぬ恋のみちかな","風をいたみ岩打つ波のおのれのみ\nくだけてものを思ふころかな"," 御垣守衛士のたく火の夜は燃え\n昼は消えつつものをこそ思へ","君がため惜しからざりし命さへ\n長くもがなと思ひけるかな",
        "かくとだにえやは伊吹のさしも草\nさしも知らじな燃ゆる思ひを","明けぬれば暮るるものとは知りながら\nなほ恨めしき朝ぼらけかな","嘆きつつひとり寝る夜の明くる間は\nいかに久しきものとかは知る","忘れじのゆく末まではかたければ\n今日を限りの命ともがな","滝の音は絶えて久しくなりぬれど\n名こそ流れてなほ聞こえけれ",
        "あらざらむこの世のほかの思ひ出に\nいまひとたびの逢ふこともがな","めぐり逢ひて見しやそれとも分かぬ間に\n雲隠れにし夜半の月影","有馬山猪名の篠原風吹けば\nいでそよ人を忘れやはする","やすらはで寝なましものをさ夜更けて\nかたぶくまでの月を見しかな","大江山いく野の道の遠ければ\nまだふみも見ず天の橋立",
        "いにしへの奈良の都の八重桜\nけふ九重に匂ひぬるかな","夜をこめて鳥のそら音ははかるとも\nよに逢坂の関は許さじ","今はただ思ひ絶えなむとばかりを\n人づてならでいふよしもがな","朝ぼらけ宇治の川霧たえだえに\nあらはれわたる瀬々の網代木 ","恨みわび干さぬ袖だにあるものを\n恋に朽ちなむ名こそ惜しけれ",
        "もろともにあはれと思え山桜\n花よりほかに知る人もなし","春の夜の夢ばかりなる手枕に\nかひなく立たむ名こそをしけれ","心にもあらで憂き夜に長らへば\n恋しかるべき夜半の月かな","嵐吹く三室の山のもみぢ葉は\n竜田の川の錦なりけり","寂しさに宿を立ち出でてながむれば\nいづくも同じ秋の夕暮れ",
        "夕されば門田の稲葉訪れて\n蘆のまろ屋に秋風ぞ吹く","音に聞く高師の浜のあだ波は\nかけじや袖のぬれもこそすれ","高砂の尾の上の桜咲きにけり\n外山のかすみ立たずもあらなむ","憂かりける人を初瀬の山おろしよ\n激しかれとは祈らぬものを","契りおきしさせもが露を命にて\nあはれ今年の秋もいぬめり",
        "わたの原漕ぎ出でて見ればひさかたの\n雲居にまがふ沖つ白波","瀬をはやみ岩にせかるる滝川の\nわれても末に逢はむとぞ思ふ","淡路島通ふ千鳥の鳴く声に\nいく夜寝覚めぬ須磨の関守","秋風にたなびく雲のたえ間より\n漏れ出づる月の影のさやけさ","ながからむ心も知らず黒髪の\n乱れてけさはものをこそ思へ",
        "ほととぎす鳴きつる方をながむれば\nただ有明の月ぞ残れる","思ひわびさても命はあるものを\n憂きに堪へぬは涙なりけり","世の中よ道こそなけれ思ひ入る\n山の奥にも鹿ぞ鳴くなる","長らへばまたこのごろやしのばれむ\n憂しと見し世ぞ今は恋しき","夜もすがらもの思ふころは明けやらぬ\nねやのひまさへつれなかりけり",
        "嘆けとて月やはものを思はする\nかこちがほなるわが涙かな","村雨の露もまだ干ぬまきの葉に\n霧立ちのぼる秋の夕暮","難波江の蘆のかりねのひとよゆゑ\n身を尽くしてや恋ひわたるべき","玉の緒よ絶えなば絶えねながらへば\n忍ぶることの弱りもぞする","見せばやな雄島の海人の袖だにも\n濡れにぞ濡れし色は変はらず",
        "きりぎりす鳴くや霜夜のさむしろに\n衣かたしきひとりかも寝む","わが袖は潮干に見えぬ沖の石の\n　　人こそ知らねかわく間もなし","世の中は常にもがもな渚漕ぐ\n海人の小舟の綱手かなしも","み吉野の山の秋風さよ更けて\nふるさと寒く衣打つなり","おほけなく憂き世の民におほふかな\nわが立つ杣にすみ染の袖",
        "花さそふ嵐の庭の雪ならで\nふりゆくものはわが身なりけり","来ぬ人を松帆の浦の夕なぎに\n焼くや藻塩の身もこがれつつ","風そよぐ楢の小川の夕暮は\n御禊ぞ夏のしるしなりける","人も愛し人も恨めしあじきなく\n世を思ふゆゑにもの思ふ身は","百敷や古き軒端のしのぶにも\nなほ余りある昔なりけり"
    ]

    
    
    
    override func viewDidLoad() {
        super.viewDidLoad()

        if (ifAnswer == true) {
        resultLabel.text = "正解"
        }else{
        resultLabel.text = "不正解"
        }
        
        wakaTextView.text = wakaArray[questionIndex] as! String

    }

    
    
    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }
    

    /*
    // MARK: - Navigation

    // In a storyboard-based application, you will often want to do a little preparation before navigation
    override func prepareForSegue(segue: UIStoryboardSegue, sender: AnyObject?) {
        // Get the new view controller using segue.destinationViewController.
        // Pass the selected object to the new view controller.
    }
    */

}
